{"blog_info":[{"title":"First Sample Blog","def":"It is on procees of development"}],"certificate_info":[{"title":"Microsoft SQL Server - Implementation and Maintenance","year":"2008"},{"title":"Microsoft .NET Framework - Application Development Foundation","year":"2010"},{"title":"Microsoft ASP.NET MVC - Web Applications","year":"2015"}],"education_info":[{"title":"Information Security,    Ryerson University Toronto, ON","year":"2013"},{"title":"Microsoft SharePoint Web Development,    Toronto, ON Ryerson University Toronto, ON","year":"2011"},{"title":"Database Application Developer (Co-op) Seneca College,    Toronto, ON","year":"2010"},{"title":"Bachelor of Engineering Degree in Computer Science Beheshti University, Tehran, Iran","year":"1991"}],"experience_info":[{"employer":"Dapasoft, Toronto, ON","period":"June 2018 - Nov 2019","title":"Full Stack Software Developer","tasks":["Design and develop FIT system using ASP MVC asynchronies programing techniques, Kendo UI, SQL Server, Entity Framework, and Azure DevOps to automate continuous software integration and delivery, using ID4 server to support authentication and authorization","Design and develop OMDC Web Application using ASP NET CORE API, SQL Server, Entity Framework core as backend and Angular 7 and Kendo UI as front end. Develop Azure DevOps to automate continuous software delivery, secure application using Azure Identity, develop services to support emails, developed unit and integration tests using Jasmin and Karma, Created Stored Procedures, Triggers and Views and developed complex SQL queries","Design and implement configurable dynamic form library for Angular to enable end-user to customize input forms","Design and developed a logging utility using Asp Net core and publish it as Nuget package "]},{"employer":"Brookfield Global Integrated Solutions, Toronto, ON","period":"Aug 2012 - June 2018","title":"Developer","tasks":["Design and develop Transaction Manager System to extract information change and load in the Transaction database and periodically send XML report files to registered clients, using Oracle, C#, ASP.NET MVC, NHibernate, AngularJs","Design and developed Cross Client Application to simulate how changes in the number of service provider and other parameter affect response time, using Oracle PL-SQL, C#, ASP.NET MVC","Support and develop RealSuite legacy application using Oracle PL-SQL, VB6 COM, ASP, Xml Transformation, Html, CSS, JavaScript, and JQuery","Design and develop Integration system using Dell Boomi to transfer information Between PmWeb, RealSuite and Finance system","Develop a multi lingual RealSuite Help system to provide instruction to end users. Using Confluence to enable users to edit and contribute in developing help pages","Develop RealSuite Installer Using Windows Installer XML, C#, MS Build","Develop a Task Service project to process tasks, by calling several threads simultaneously, using Asp Web API, Oracle, and Windows Task scheduler","Enhanced Visual Studio project to support a multiple framework"]},{"employer":"Citizenship and Immigration Canada (CIC), Toronto, ON","period":"May 2010 - Aug 2012","title":"Web Developer","tasks":["Developed Settlement system with VB.NET, ASP.Net, CSLA.NET and SQL Server, DevExpress, HTML, CSS, JavaScript and JQuery","Developed Resettlement Assistance Program with Excel and VBA","Developed Case Tracking System with ASP.Net, CSLA.NET and SQL Server ASP.Net, DevExpress","Developed ETL Application to extract and transfer information from a legacy system and load into .NET applications using SQL Server Integration Services","Developed UI Test program using Selenium"]},{"employer":"Merco Industries Limited. (Aerospace Industry), Toronto, ON","period":"Sep 2004 - May 2010","title":"Programmer","tasks":["Developed reports to search for a tool for specific machinery task based on user criteria using VB6 and MS ACCESS"]},{"employer":"Butane Ind. Company, Tehran, Ira","period":"Sep 1994 - May 2003","title":"System Analyst and Programmer","tasks":["Designed and developed business application using Delphi"]}],"highlight_info":[{"def":"Design & develope .NET Infrastructure library"},{"def":"Experienced with Test Driven Development using NUnit and MS Test, Jasmin, Karma"},{"def":"Develop backend services using ASP Net Api and Entity Framework"},{"def":"Develop Help system using Confluence CMS"},{"def":"Develop Oracle PL-SQL packages to synchronize several databases"},{"def":"Develop SPA application using Angular, Kedo UI, Bootstrap, ASP.NET core and SQL Server"},{"def":"Develop SPA application using Asp net Web Api, Angular, NHibernate"}],"link_info":[{"title":"Two-Factor Authentication into Angular Apps","url":"https://levelup.gitconnected.com/building-expedited-two-factor-authentication-into-angular-apps-with-authy-903c182f32de","def":"Two-Factor Authentication (2FA) provides web applications with an important additional layer of security, but 2FA requires the user to perform an additional action each time they log in."},{"title":"Securing Asp Web Core applications with mTLS","url":"https://medium.com/@therealjordanlee/securing-web-applications-with-mtls-asp-net-core-2-x-e93660b6b9ea","def":"TLS is a way of securing network traffic between a client and a server through the use of asymmetric cryptography. This protects the data from man-in-the-middle (mitm) attacks, as anybody sniffing the traffic across the network would just see a garbled mess."},{"title":"User Secrets in ASP.NET Core","url":"https://medium.com/datadigest/user-secrets-in-asp-net-core-with-jetbrains-rider-26c381177391","def":"The Secret Manager is a tool that allows you to store app secrets in a JSON file that lives outside the project tree, but access them through the Configuration API"},{"title":"Generic MatTable","url":"https://medium.com/better-programming/angular-material-build-your-own-generic-mattable-a49ba68a375a","def":"First and foremost, it’s important you understand the decorator concept in Typescript and how MatTable works."},{"title":"TypeScript Best Practices","url":"https://medium.com/better-programming/8-best-practices-for-future-proofing-your-typescript-code-2600fb7d8063","def":"Whether you are building libraries, front-end or back-end applications using JavaScript, the small effort of switching to TypeScript is already a big step towards future-proofing your code"},{"title":"9 Ideas For Angular ","url":"https://medium.com/better-programming/9-major-ideas-for-angular-that-are-often-overlooked-by-developers-272a553335a7","def":"Angular has been around for some time now but a lot of us still struggle with scaling our applications to match the demands of the requirements. Drawing from the past several years of working with Angular apps for clients, I’ve made a list of nine major ideas that are often overlooked. These are patterns of implementation that can help accelerate the quality of your final product."},{"title":"Angular Performances","url":"https://blog.ninja-squad.com/2018/09/06/angular-performances-part-1/","def":"this blog post is about the first load of an Angular application. In future posts, we’ll talk about how to make reloading faster, then about how to profile your running application, and how to improve runtime performances. If you are the lucky owner of our ebook, you can already check the other parts if you download the last ebook release"},{"title":"why you will not find components inside Angular","url":"https://blog.ninja-squad.com/2018/09/06/angular-performances-part-1/","def":"this blog post is about the first load of an Angular application. In future posts, we’ll talk about how to make reloading faster, then about how to profile your running application, and how to improve runtime performances. If you are the lucky owner of our ebook, you can already check the other parts if you download the last ebook release"},{"title":"Patterns for Microfrontends","url":"https://blog.bitsrc.io/6-patterns-for-microfrontends-347ae0017ec0","def":"the patterns that are possible for actually realizing a microfrontend architecture. What is the right way to implement microfrontends?. It very much depends on what we are after"},{"title":"Six RxJs Operators That you Must Know","url":"https://netbasal.com/rxjs-six-operators-that-you-must-know-5ed3b6e238a0","def":"1. Concat,2. forkJoin,3. mergeMap ,4. pairwise, 5. switchMap ,6. combineLatest "}],"technical_info":[{"title":"Microsoft SQL Server","def":"10 years"},{"title":"Kendo UI","def":"3 years"},{"title":"JavaScript","def":"10 years"},{"title":"Oracle","def":"5 years"},{"title":"C#.NET, VB.NET","def":"12 years"},{"title":".NET Core","def":"2 years"},{"title":"NHibernate, Entity framework","def":"5 years"},{"title":"ASP Forms","def":"8 years"},{"title":"Angular, AngularJs","def":"7 years"},{"title":"Business Intelligent","def":"5 Years"},{"title":"ASP MVC, API","def":"10 years"},{"title":"Dell Boomi","def":"1 years"},{"title":"Share Point","def":"1 years"},{"title":"RESTFULL & OData","def":"8 years"},{"title":"Bootstrap","def":"7 years"},{"title":"SQL Integration Services","def":"1 years"},{"title":"Selenium","def":"1 years"},{"title":"Azure DevOps","def":"1 years"},{"title":"SQL Report Server","def":"1 years"},{"title":"Delphi","def":"5 years"},{"title":"HTML, CSS","def":"10 years"},{"title":"Microsoft Access, VBA","def":"1 years"},{"title":"Power Shell","def":"1 years"},{"title":"Confluence Atlassian","def":"2 years"}],"tool_info":[{"title":"Can I Use","url":"https://caniuse.com/","def":"If you’ve ever wondered about browser compatibility for any web APIs (e.g.: local storage), Can I use is the place to go. It offers updated support tables to determine the support of APIs for desktop and mobile browsers."},{"title":"Unminify","url":"https://unminify.com/","def":"Unminify.com is a free online tool to unminify (unpack, deobfuscate) JavaScript, CSS, and HTML code, making it readable and pretty. It’s one of the most-used websites for code beautification."},{"title":"Compressor","url":"https://compressor.io/","def":"Compressor.io is an online tool for reducing the size of your images without losing image quality. The tool is so good that there is almost no difference before and after compression of the image."},{"title":"Cloudcraft","url":"https://cloudcraft.co/","def":"Cloudcraft helps you design and budget your cloud. It has a very cool drag and drop interface to create 3D diagrams, by connecting different cloud infrastructure services (currently only for AWS)."},{"title":"Repl.it","url":"https://repl.it/","def":"Repl.it is the perfect online IDE that you have been looking for, all those years. You can boot any programming environment for your favorite language or tech stack in less than two seconds."},{"title":"RequestBin","url":"https://requestbin.com/","def":"RequestBin gives you an instant HTTP endpoint that will collect all the requests sent so that you can interpret them easily to check and validate data."},{"title":"Web Code","url":"https://webcode.tools/","def":"Web Code is one of the best code generators out there. You can generate code for various basic and advanced needs by just entering your requirements."},{"title":"BundlePhobia","url":"https://bundlephobia.com/","def":"BundlePhobia helps you analyze how much size an npm package can add to your project."},{"title":"Fingerprint.js","url":"https://fingerprintjs.com/","def":"this awesome library produces a distinctive browser identifier without the use of cookies or any data that a malicious user can reset readily. It quickly extracts numerous properties from a web browser, which can be used separately, or to create a hash which can be used to identify a unique user."},{"title":"Canva","url":"https://www.canva.com/","def":"Canva has a mission to empower the world to design. With our simple design tool and a can-do attitude, you’ll be achieving your creative goals in no time"},{"title":"palettes","url":"https://www.happyhues.co/palettes/6","def":"eally pretty collection of color combinations"},{"title":"line-awesome","url":"https://icons8.com/line-awesome","def":"Swap Font Awesome for modern line icons in one line of code."},{"title":"fontpairings","url":"https://fontpairings.bypeople.com/","def":"Find the best font pairings for your next project."},{"title":"Remove-backgrounds","url":"https://www.stickermule.com/trace","def":"Instantly remove the background from your photos."},{"title":"colorbox","url":"https://www.colorbox.io/","def":"Color is instrumental in how we perceive the world, and that could not be more true within interfaces. Color guides us to predict, understand, and make decisions."}]}