[
  { "title": "Two-Factor Authentication into Angular Apps", "url":"https://levelup.gitconnected.com/building-expedited-two-factor-authentication-into-angular-apps-with-authy-903c182f32de", "def": "Two-Factor Authentication (2FA) provides web applications with an important additional layer of security, but 2FA requires the user to perform an additional action each time they log in."},
  { "title": "Securing Asp Web Core applications with mTLS", "url":"https://medium.com/@therealjordanlee/securing-web-applications-with-mtls-asp-net-core-2-x-e93660b6b9ea", "def": "TLS is a way of securing network traffic between a client and a server through the use of asymmetric cryptography. This protects the data from man-in-the-middle (mitm) attacks, as anybody sniffing the traffic across the network would just see a garbled mess." },
  { "title": "User Secrets in ASP.NET Core", "url":"https://medium.com/datadigest/user-secrets-in-asp-net-core-with-jetbrains-rider-26c381177391", "def": "The Secret Manager is a tool that allows you to store app secrets in a JSON file that lives outside the project tree, but access them through the Configuration API" },
  { "title": "Generic MatTable", "url": "https://medium.com/better-programming/angular-material-build-your-own-generic-mattable-a49ba68a375a", "def": "First and foremost, it’s important you understand the decorator concept in Typescript and how MatTable works." },
  { "title": "TypeScript Best Practices", "url":"https://medium.com/better-programming/8-best-practices-for-future-proofing-your-typescript-code-2600fb7d8063", "def":"Whether you are building libraries, front-end or back-end applications using JavaScript, the small effort of switching to TypeScript is already a big step towards future-proofing your code" },
  { "title": "9 Ideas For Angular ", "url":"https://medium.com/better-programming/9-major-ideas-for-angular-that-are-often-overlooked-by-developers-272a553335a7", "def": "Angular has been around for some time now but a lot of us still struggle with scaling our applications to match the demands of the requirements. Drawing from the past several years of working with Angular apps for clients, I’ve made a list of nine major ideas that are often overlooked. These are patterns of implementation that can help accelerate the quality of your final product." }
]
